app/views/api/v1/categories/index.json.jbuilder


json.categories @categories.each do |category|
---
SELECT "categories".* FROM "categories"