app/views/api/v1/categories/show.json.jbuilder

SELECT "albums".* FROM "albums" WHERE "albums"."category_id" = ?  [["category_id", 1]]
---
end
json.albums @category.albums.each do |album|