app/views/api/v1/search/index.json.jbuilder

SELECT "songs".* FROM "songs" WHERE (title LIKE'%%')
---
json.songs @songs.each |song|

SELECT "artists".* FROM "artists" WHERE (name LIKE'%%')
---
end
json.artists @artists.each |artist|

SELECT "albums".* FROM "albums" WHERE (title LIKE'%%')
---
end
json.albums @albums.each |album|