app/controllers/api/v1/favorites_controller.rb

    def index
        @favorite_albums = current_user.favorites.where(favoritable_type: "Album").map(&:favoritable)
        @favorite_songs = current_user.favorites.where(favoritable_type: "Song").map(&:favoritable)
        @favorite_artists = current_user.favorites.where(favoritable_type: "Artist").map(&:favoritable)
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 1], ["favoritable_type", "Album"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 1], ["favoritable_type", "Song"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."favoritable_type" = ?  [["user_id", 1], ["favoritable_type", "Artist"]]

    def create
        current_user.favorites.create(favoritable_type: params[:favoritable_type], favoritable_id: params[:id])
---
INSERT INTO "favorites" ("user_id", "favoritable_type", "favoritable_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["favoritable_type", "Song"], ["favoritable_id", 1], ["created_at", "2020-04-15 05:39:45.433006"], ["updated_at", "2020-04-15 05:39:45.433006"]]